Aplicacion/app/controllers/marcas_controller.rb

SELECT `marcas`.* FROM `marcas`
---
  def index
    @marcas = Marca.all

INSERT INTO `marcas` (`nombre`, `created_at`, `updated_at`) VALUES ('Sony', '2017-07-29 08:11:11', '2017-07-29 08:11:11')
---
  def create
    @marca = Marca.new(marca_params)
    respond_to do |format|

      if @marca.save

UPDATE `marcas` SET `nombre` = 'Sony2', `updated_at` = '2017-07-30 06:59:03' WHERE `marcas`.`id` = 1
---
  def update
    respond_to do |format|
      if @marca.update(marca_params)

DELETE FROM `marcas` WHERE `marcas`.`id` = 3
---
  def destroy
    @marca.destroy

SELECT  `marcas`.* FROM `marcas` WHERE `marcas`.`id` = 3 LIMIT 1
---
    def set_marca
      @marca = Marca.find(params[:id])