Aplicacion/app/controllers/productos_controller.rb

SELECT `productos`.* FROM `productos`
---
  def index
    @productos = Producto.all

INSERT INTO `productos` (`nombre`, `precio`, `descripcion`, `created_at`, `updated_at`, `marca_id`) VALUES ('Smart TV', 50.0, '4K HDR Processor X1™ Extreme para un realismo definitivo\r\nContraste sin precedentes con Backlight Master Drive™\r\nIncreíble contraste con X-tended Dynamic Range™ PRO\r\nAmplia gama de colores con TRILUMINOS Display', '2017-07-29 17:25:07', '2017-07-29 17:25:07', 1)
---
  def create
    @producto = Producto.new(producto_params)

    respond_to do |format|
      if @producto.save

UPDATE `productos` SET `precio` = 100.0, `updated_at` = '2017-07-29 23:01:57' WHERE `productos`.`id` = 4
---
  def update
    respond_to do |format|
      if @producto.update(producto_params)

DELETE FROM `productos` WHERE `productos`.`id` = 2
---
  def destroy
    @producto.destroy

SELECT  `productos`.* FROM `productos` WHERE `productos`.`id` = 4 LIMIT 1
---
    def set_producto
      @producto = Producto.find(params[:id])