Aplicacion/app/views/productos/_form.html.erb

SELECT `marcas`.* FROM `marcas`
---
  <div class="col-sm-9">
  <%= f.collection_select :marca_id, Marca.all, :id, :nombre, {}, {class: "form-control"} %>